constant/granularRheologyProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      granularRheologyProperties;
}
// ************************************************************************* //

granularRheology       on; //off; //on;
granularCohesion       off; // No cohesion for clean sand.
granularDilatancy      off; // Start without dilatancy. It can be activated later if needed.

// Maximum solid volume fraction used in granular rheology.
alphaMaxG              alphaMaxG  [0 0 0 0 0 0 0] 0.635; //0.625; //0.55-0.6

// Static and dynamic friction coefficients.
// These are model assumptions for non-cohesive sand.
mus                    mus  [0 0 0 0 0 0 0] 0.63; //0.38; //0.3-0.7 //diff

mu2                    mu2  [0 0 0 0 0 0 0] 1.13; //0.64; //0.6-1.2 //diff

// Empirical coefficients for mu(I)-type rheology.
// They are retained even when Coulomb friction is used.
I0                     I0    [0 0 0 0 0 0 0] 0.6; //0.30; //0.005-0.6 //diff

Bphi                   Bphi  [0 0 0 0 0 0 0] 0.66; //0.31; //0.3-1 //diff

// Exponent for effective fluid viscosity model.
n                      n  [0 0 0 0 0 0 0] 2.5; //1-3

// Bulk viscosity factor.
BulkFactor             BulkFactor  [0 0 0 0 0 0 0] 0; //0-10

// Regularization parameter.
Dsmall                 Dsmall  [0 0 -1 0 0 0 0] 1e-4;//1e-4-1e-9

// Relaxation factor for particle pressure correction.
// Smaller values can improve stability in dense-bed calculations.
relaxPa                relaxPa  [0 0 0 0 0 0 0] 3e-4; //0.005; //1e-9-1

//FrictionModel          Coulomb;
FrictionModel          MuIv;

// Shear-induced particle pressure model.
// Start with none because ppProperties already supplies contact pressure.
//PPressureModel         none;
PPressureModel         MuIv;

// Effective fluid viscosity model in concentrated suspension.
//FluidViscosityModel    KriegerDougherty;
//FluidViscosityModel    Einstein;
FluidViscosityModel    BoyerEtAl;


// ************************************************************************* //
