constant/interfacialProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      interfacialProperties;
}
// ************************************************************************* //

dragModela      GidaspowSchillerNaumann; //GidaspowErgunWenYu;

dragModelb      GidaspowSchillerNaumann; //GidaspowErgunWenYu;

dragPhase       a;

// ************************************************************************* //
