constant/twophaseRASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      twophaseRASProperties;
}
// ************************************************************************* //

// Turbulent Schmidt number for suspended sediment.
// Start from 0 following the sedFoam default-style setting.
SUSread         SUSread         [0 0 0 0 0 0 0] 0;

// Local suspended sediment turbulence correction.
SUSlocal        false;

// Minimum friction velocity for local correction.
Usmall          Usmall          [0 1 -1 0 0 0 0] 1e-6;

// k-epsilon model constant.
Cmu             Cmu             [0 0 0 0 0 0 0] 0.09;

// Empirical parameter for turbulent drag correction.
B               B               [0 0 0 0 0 0 0] 0.25;

// Small values for numerical regularization.
kSmall          kSmall          [0 2 -2 0 0 0 0] 1e-6;
TpSmall         TpSmall         [1 -3 -1 0 0 0 0] 1e-6;

// Maximum eddy viscosity.
nutMax          nutMax          [0 2 -1 0 0 0 0] 1e-4; //5e-3;

// Turbulence modulation switches.
KE1             KE1             [0 0 0 0 0 0 0] 0;
KE2             KE2             [0 0 0 0 0 0 0] 0;
KE3             KE3             [0 0 0 0 0 0 0] 0;
KE4             KE4             [0 0 0 0 0 0 0] 0;

// ************************************************************************* //
